#數字矩陣(正方形)
w=int(input())  #輸入一個正整數 當寬
h=int(input())  #輸入一個正整數 當高
x1=0            #先設x1 跟y1 ,那y1這邊要1,因為開頭為1 
y1=1           #y1=1 x1是看答案行數做行駛
for i in range(1,h+1,1) : #把高放入外圈 1<h+1 1次+1
    for j in range(1,w+1,1) : #把寬放入內圈 1<w+1 1次+1
        y1=y1+x1             #在這內圈做計算循環,並且列印也放裡面,因為print
        print(y1,end="\t")   #有下end,所以這print就不換行,一直循環到外圈結束就往下
        y1+=1
    print()           #往下換行,換下一行開始
    x1+=1            #x1看行數+1
    y1=1            #y1強制歸1  ,以此類推做到外圈for循環結束

#w=5 h=3
#A:1   2   3   4   5
#  2   4   6   8   10
#  3   6   9   12  15    