#數字矩陣正方形 每一行開頭都由大至小
w=int(input())#此w當做寬度
h=int(input())#此h當做高度
for i in range(1,h+1,1) : #外圈for放高度進去,循環-> 1<(h+1) 每循環一次+(1)
    for j in range(w,0,-1) : #內圈for放寬度進去,w當頭循環-> j=w j>0 每循環一次+(-1)
        print((j*i),end="\t") #列印是目前for j值跟外圈for i值相乘 ,相乘後列印並且在"\t",不換行
    print() #一行OK後換下一行,下一行做上述動作    

#程式循環圖形表格介紹如下:(假設w設5 h設3)
# 目前的行數  for i->(當做高度)  一開始for j->(當做寬度(值))   (j*i)循環列印出來
#  第一行      1 (1<(3+1))       5 w=5  j=w               5(5*1) 4(4*1) 3(3*1) 2(2*1) 1(1*1)       
#  第二行      2 (2<(3+1))       5 w=5  j=w              10(5*2) 8(4*2) 6(3*2) 4(2*2) 2(1*2) 
#  第三行      3 (3<(3+1))       5 w=5  j=w              15(5*3) 12(4*3) 9(3*3) 6(2*3) 3(1*3)


#輸入(w)->5                 4
#輸入(h)->3                 6
#輸出答案如下:
#5   4   3   2   1          4   3   2   1
#10  8   6   4   2          8   6   4   2
#15  12  9   6   3          12  9   6   3
#                           16  12  8   4 
#                           20  15  10  5 
#                           24  18  12  6


    