#數字矩陣 (三角形)
h=int(input()) #輸入一個高
x1=0      #x1這邊是看高,並且正向,開頭為0, 然後y1一開始設1,這樣的話我一開始
y1=1      #y1=y1+x1 會比較好對,也符合
for i in range(1,h+1,1) : #外圈for是放高, 1<h+1 1次+1
    for j in range(1,i+1,1) : #內圈for是取我目前的高值,因為是三角形,所以 i<i+1 1次+1
        y1=y1+x1            #計算方面再內圈for做 並且內圈的print放值,並且循環for
        print(y1,end="\t") #那內圈的print因為有下end所以不換行,一直循環內圈forOK
        y1+=1           #為止
    print()   #每完成一行OK之後,內圈forOK之後來到這邊換行,做下一行
    x1+=1    #x1這邊+1 y1強制歸1,用來做下一行三角形矩陣,一直循環到整體外圈forOK
    y1=1     #外圈forOK就OK了

# h->6
# A:1
#   2   4 
#   3   6   9
#   4   8   12  16
#   5   10  15  20  25 
#   6   12  18  24  30  36
