#數字矩陣正反面 (正方形)
w=int(input()) #輸入一個正整數 為寬
h=int(input()) #輸入一個正整數 為高
x1=0    #x1正邊是正向 開頭為0 所以x1是看高的行數來輔助
y1=1   #y1一開始為1
for i in range(1,h+1,1) : #正向外圈for是高 所以 1<h+1 1次+1
    for j in range(1,w+1,1) :#正向內圈for是寬 所以 1<w+1 1次+1
        y1=y1+x1           #計算方面再內圈這邊計算,列印也是,那print有下end
        print(y1,end="\t") #所以就不換行,一直循環到內圈forOK
        y1+=1
    print()    #內圈for ok之後換行,換下一行來做
    x1+=1    #並且正向,x1換一行+1
    y1=1     #y1這邊強制變1
x2=(h-1)-1  #這邊的h-1是因為這裡開始是反向,所以反向x2是看高的值,並且-1 而後面再-1
y2=1        #是因為我for k 高這邊h-1,所以在-1 搭配我y2=1 一開始y2=y2+x2 才會順利
for k in range(h-1,0,-1) : #反向外圈for是高 所以h先-1之後 h-1>0 1次+(-1)
    for k1 in range(1,w+1,1) : #反向內圈for是寬 所以一樣 1<w+1 1次+1
        y2=y2+x2              #計算方面在內圈這計算,列印也是,那print這有下end
        print(y2,end="\t")   #所以就不換行,一直循環到內圈forok
        y2+=1
    print() #反向這邊,內圈forOK之後換行,換下一行來做
    x2-=1  #因為反向,由高至低,所以x2-=1
    y2=1  #這邊y2依然強制變1
    
# w->5 h->3
# A:1   2   3   4   5
#   2   4   6   8   10 
#   3   6   9   12  15 
#   2   4   6   8   10
#   1   2   3   4   5
     