m=float(input()) #輸入一個我要四捨五入的值
n=int(input())   #輸入一個n,此n代表四捨五入到小數點第幾位
print("%.{0}f".format(n)%m) #列印時用.format(字串格式化)的方式列印
                            #.format括號裡放我的n,然後.format括號裡第1個值從0開始
                            #所以括號裡的n在.format裡為0,所以對到前面的"%.{0}f"
                            #他會把n值丟入{0}
                            #之後丟進去變成"%.nf"然後再把%m針對這m值丟過去做四捨五入之後OK後再列印

#題目:四捨五入到小數點第n位
#輸入n->2.24   3.14159   0.78    3.14159     3.14159     2.657
#輸入m->0      2         0       3           4           1
#   A:->2      3.14      1       3.142       3.1416      2.7