data=[[0]*7 for o in range(5)]#設一個二維陣列 [[0]*7]為取7個值(從0開頭) for o in range(5)為取高(從0開頭(高0))
for i in range(0,5,1) : #for i 為高
    for j in range(0,7,1) : #for j 為值
        data[i][j]=int(input()) #把目前位於的data[i][j]取一個我所輸入的正整數值1個給目前的i跟j位置上 i為高 j為值
for a in range(7-1,-1,-1) : #把取到的data高5值7的值做"反向側翼取值" for a 先假設為高 而輸出是要7*5(高7值5)
    for b in range(0,5,1) : #for b假設為值
        print(data[b][a],end="\t") #這行是重點,把原本的高(a)值(b)互換,變成data[b][a],然後因為是"反向側翼取值",所以
    print() #<-每列印1行OK就換行,換下一行繼續列印     #data這邊已經有陣列正整數值,所以依照"反向側翼取值"1個1個值取出來列印

#補充:如果要使用反向側翼取值,先看上方data二維陣列有沒有陣列正整數值,並且看答案是否真的為反向側翼取值
#     如果是就可以使用反向側翼取值
#補充:反向側翼取值->反向側翼取值是如範例題目裡的97 34 77 89 60這行就是側翼,反向用意就是由後往前取
#                  所以從97 34 77 89 60這行開始取完接著取0 39 55 99 92以此類推由後往前取反向側翼
#題目範例如下:
#81  7   7   10  97  0   97
#90  67  8   25  1   39  34
#9   54  63  53  53  55  77 
#28  8   17  50  41  99  89
#5   1   95  99  76  92  60
#上述題目範例在python裡顯示5*7矩陣如下:
#[[81,7,7,10,97,0,97],[90,67,8,25,1,39,34],[9,54,63,53,53,55,77],
#  [28,8,17,50,41,99,89],[5,1,95,99,76,92,60]]

#反向側翼取值答案如下:
#97  34  77  89  60
#0   39  55  99  92
#97  1   53  41  76 
#10  25  53  50  99
#7   8   63  17  95
#7   67  54  8   1
#81  90  9   28  5


#反向側翼取值答案示意圖:
#           b   a      b   a      b   a      b   a      b    a                   
#      97   0   6  34  1   6  77  2   6  89  3   6  60  4    6
#      0    0   5  39  1   5  55  2   5  99  3   5  92  4    5 
#      97   0   4  1   1   4  53  2   4  41  3   4  76  4    4
#      之後下方與上面示意圖做一樣的反向側翼取值到範例題目由後往前取為止!
