#輸入n個學號 學號排序由小到大(外加學號數字拆解)
n=int(input()) #輸入n個學號
arr=[]   #用一維陣列取n個學號
for o in range(0,n,1) : #for o 每循環1次就取1個學號給arr(一維陣列)自己 陣列開頭必為0
    arr+=[int(input())]
arr.sort()    #把取到的arr一維陣列裡的學號在這裡面做遞增排序(sort)(而這行是由小到大)
a=len(arr)    #做完遞增排序由小到大,就算arr一維陣列的長度(也就是從值0開始有幾個值)
for i in range(0,a,1) : #算出來的長度丟入for i循環 陣列第1個值必為0
    ch=str(arr[i]) #依照for i 循環,每循環1次就取arr目前位於的i位置值轉str給ch生成值
    aa=len(ch) 
    for j in range(0,aa,1) : #算出來的長度丟到for j 循環,每循環1次就取j位於的ch單字串值,而取單字串第一個單字串必為0
       if j==(aa-1) : #如果j==(aa(總字串長度)-1) 那就進去
           print(ch[j],end="") #進去後,就代表這個j已經是要取最後1個單字串,而取ch的最後1個單字串取完列印後不可空格
       else : #其他只要j不等於aa(總長度字串)-1 那就進去
           print(ch[j],end=" ") #進去後就列印目前ch位於的j位置的單字串值,列印完就空格
    print() #之後for j循環OK後就來到這邊換行,然後取下一個學號做上述動作到結束!

#輸入->3                    輸入->4    
#輸入->103021020            輸入->102365101
#      105074011                 107021563
#      102033058                 99810652
#                                104120601
#A:->1 0 2 0 3 3 0 5 8 A:->9 9 8 1 0 6 5 2
#    1 0 3 0 2 1 0 2 0     1 0 2 3 6 5 1 0 1
#    1 0 5 0 7 4 0 1 1     1 0 4 1 2 0 6 0 1
#                          1 0 7 0 2 1 5 6 3
#
#    