m=int(input("請輸入月份: ")) #一開始m為你所輸入的值轉int,此m是拿來查明月份
data=[["                    1    2", #data為二維陣列,為後方給值的二維陣列
       "3   4   5   6   7   8    9", #然後這邊我設定高0為1月 高1為2月 高2為3月
       "10  11  12  13  14  15   16",#高3為4月 高4為5月 高5為6月  高6為7月
       "17  18  19  20  21  22   23",#高7為8月 高8為9月 高9為10月 高10為11月
       "24  25  26  27  28  29   30", #高11為12月
       "31"],
      ["    1   2   3   4   5    6",
       "7   8   9   10  11  12   13",
       "14  15  16  17  18  19   20",
       "21  22  23  24  25  26   27",
       "28"],
      ["    1   2   3   4   5    6",
       "7   8   9   10  11  12   13",
       "14  15  16  17  18  19   20",
       "21  22  23  24  25  26   27",
       "28  29  30  31"],
      ["                1   2    3",
       "4   5   6   7   8   9    10",
       "11  12  13  14  15  16   17",
       "18  19  20  21  22  23   24",
       "25  26  27  28  29  30"],
      ["                         1",
       "2   3   4   5   6   7    8",
       "9   10  11  12  13  14   15",
       "16  17  18  19  20  21   22",
       "23  24  25  26  27  28   29",
       "30  31"],
      ["        1   2   3   4    5",
       "6   7   8   9   10  11   12",
       "13  14  15  16  17  18   19",
       "20  21  22  23  24  25   26",
       "27  28  29  30"],
      ["                1   2    3",
       "4   5   6   7   8   9    10",
       "11  12  13  14  15  16   17",
       "18  19  20  21  22  23   24",
       "25  26  27  28  29  30   31"],
      ["1   2   3   4   5   6    7",
       "8   9   10  11  12  13   14",
       "15  16  17  18  19  20   21",
       "22  23  24  25  26  27   28",
       "29  30  31"],
      ["            1   2   3    4",
       "5   6   7   8   9   10   11",
       "12  13  14  15  16  17   18",
       "19  20  21  22  23  24   25",
       "26  27  28  29  30"],
      ["                    1    2",
       "3   4   5   6   7   8    9",
       "10  11  12  13  14  15   16",
       "17  18  19  20  21  22   23",
       "24  25  26  27  28  29   30",
       "31"],
      ["    1   2   3   4   5    6",
       "7   8   9   10  11  12   13",
       "14  15  16  17  18  19   20",
       "21  22  23  24  25  26   27",
       "28  29  30"],
      ["            1   2   3    4",
       "5   6   7   8   9   10   11",
       "12  13  14  15  16  17   18",
       "19  20  21  22  23  24   25",
       "26  27  28  29  30  31"]]
print("S   M   T   W   T   F   Sat")
if m==1 : #如果m是1就進去,進去代表要列印1月份月曆
    a=len(data[0]) #a為data高0裡有幾個值的長度
    for x1 in range(0,a,1) : #之後再把幾個值的長度a丟到for x1裡->0<a 每循環1次+1
        print(data[0][x1]) #之後每循還1次列印data高0值x1位置值出來,然後再換行
        print() #換行後來到這邊,在換行一次
elif m==2 : #此elif意思如同上述if m==1 :意思
    a1=len(data[1])
    for x2 in range(0,a1,1) :
        print(data[1][x2])
        print()
elif m==3 : #此elif意思如同上述if m==1 :意思
    a2=len(data[2])
    for x3 in range(0,a2,1) :
        print(data[2][x3])
        print()
elif m==4 : #此elif意思如同上述if m==1 :意思
    a3=len(data[3])
    for x4 in range(0,a3,1) :
        print(data[3][x4])
        print()
elif m==5 :  #此elif意思如同上述if m==1 :意思
    a4=len(data[4])
    for x5 in range(0,a4,1) :
        print(data[4][x5])
        print()
elif m==6 : #此elif意思如同上述if m==1 :意思
    a5=len(data[5])
    for x6 in range(0,a5,1) :
        print(data[5][x6])
        print()        
elif m==7 : #此elif意思如同上述if m==1 :意思
    a6=len(data[6])
    for x7 in range(0,a6,1) :
        print(data[6][x7])
        print()
elif m==8 : #此elif意思如同上述if m==1 :意思
    a7=len(data[7])
    for x7 in range(0,a7,1) :
        print(data[7][x7])
        print()
elif m==9 : #此elif意思如同上述if m==1 :意思
    a8=len(data[8])
    for x8 in range(0,a8,1) :
        print(data[8][x8])
        print()
elif m==10 :  #此elif意思如同上述if m==1 :意思
    a9=len(data[9])
    for x9 in range(0,a9,1) :
        print(data[9][x9])
        print()
elif m==11 : #此elif意思如同上述if m==1 :意思
    a10=len(data[10])
    for x10 in range(0,a10,1) :
        print(data[10][x10])
        print()
elif m==12 : #此elif意思如同上述if m==1 :意思
    a11=len(data[11])
    for x11 in range(0,a11,1) :
        print(data[11][x11])
        print()
#此月份顯示是依照2021去做顯示