n=int(input()) #輸入一個正整數
count=0 #count為計數位數
while n>=1 : #此while是負責算計數位數
    count+=1 #每循環1次先count+1,先算一個位數
    n=n//10 #然後n再除以(//)10,取商數
data=[["       ", #此data二維陣列是負責依照計數位數對應的矩陣字母位數
       "    *  ", #高0部份為個位數 高1部份為十位數 高2部份為百位數
       "    *  ", #高3部份為千位數 高4部份為萬位數 高5部份為十萬以上位數 
       " ****  ", #注意:到時候列印時data高的部份放count,然後記得減1,因為高
       " *  *  ", #第一個高為0,也就是從高0開始
       " ****  "],
      ["       ",
       " ***** ",
       "   *   ",
       "   *   ",
       "   *   ",
       "   *   "],
      ["       ",
       " *   * ",
       " *   * ",
       " ***** ",
       " *   * ",
       " *   * "],
      ["       ",
       "*** *  ",
       " *  *  ",
       " *  ***",
       " *  * *",
       " *  * *"],
      ["       ",
       " *   * ",
       " ** ** ",
       " * * * ",
       " *   * ",
       " *   * "],
      ["       ",
       "* * ***",
       "* * * *",
       "* * ***",
       "* * *  ",
       "*** *  "]]
if count==1 : #這邊就是列印矩陣字母的地方,這行是如果count是1就進去
    for i in range(0,6,1) : #for i負責列印矩陣字母 i部份為取data二維陣列的值 每個高第一個值都為0 所以從0開始
        print(data[count-1][i]) #高的部份放count(位數),記得減1,因為高第一個高為0,每循環1次列印data目前的[count-1](高)[i](值)的矩陣部份
        print() #然後再換行,換下一行列印,注意:之後下方的elif部份都跟此if迴圈部份循環一樣
elif count==2 :
    for i in range(0,6,1) :
        print(data[count-1][i])
        print()
elif count==3 :
    for i in range(0,6,1) :
        print(data[count-1][i])
        print()
elif count==4 :
    for i in range(0,6,1) :
        print(data[count-1][i])
        print()
elif count==5 :
    for i in range(0,6,1) :
        print(data[count-1][i])
        print()
elif count>=6 : #6位數以上代表十萬以上,所以統一丟這
    for i in range(0,6,1) :
        print(data[5][i]) #十萬以上data高統一放高5,然後值的部份一樣跟其他位數一樣放i
        print()
else : #此else是位數0才會進來
    print("沒有位數!") #進來顯示"沒有位數!"

#題目說明:輸入一個正整數,判斷他是幾位數,並且用矩陣字母顯示該正整數位數,個位數為d,十位數為T,百位數為H,
#       千位數為Th,萬位數為M,十萬位數以上統一為UP顯示,注意:0顯示為沒有位數!         
        
